docs/latex/figures/packages_CustomUnitaj.dot
digraph "packages_CustomUnitaj" {
rankdir=BT
charset="utf-8"
"unitraj" [color="black", label="unitraj", shape="box", style="solid"];
"unitraj.configs" [color="black", label="unitraj.configs", shape="box", style="solid"];
"unitraj.configs.experiment_config" [color="black", label="unitraj.configs.experiment_config", shape="box", style="solid"];
"unitraj.configs.path_config" [color="black", label="unitraj.configs.path_config", shape="box", style="solid"];
"unitraj.configs.wandb_config" [color="black", label="unitraj.configs.wandb_config", shape="box", style="solid"];
"unitraj.data_analysis" [color="black", label="unitraj.data_analysis", shape="box", style="solid"];
"unitraj.datasets" [color="black", label="unitraj.datasets", shape="box", style="solid"];
"unitraj.datasets.MTR_dataset" [color="black", label="unitraj.datasets.MTR_dataset", shape="box", style="solid"];
"unitraj.datasets.autobot_dataset" [color="black", label="unitraj.datasets.autobot_dataset", shape="box", style="solid"];
"unitraj.datasets.base_dataparser" [color="black", label="unitraj.datasets.base_dataparser", shape="box", style="solid"];
"unitraj.datasets.base_dataset" [color="black", label="unitraj.datasets.base_dataset", shape="box", style="solid"];
"unitraj.datasets.common_utils" [color="black", label="unitraj.datasets.common_utils", shape="box", style="solid"];
"unitraj.datasets.dataparser" [color="black", label="unitraj.datasets.dataparser", shape="box", style="solid"];
"unitraj.datasets.types" [color="black", label="unitraj.datasets.types", shape="box", style="solid"];
"unitraj.datasets.wayformer_dataset" [color="black", label="unitraj.datasets.wayformer_dataset", shape="box", style="solid"];
"unitraj.evaluation" [color="black", label="unitraj.evaluation", shape="box", style="solid"];
"unitraj.k_means" [color="black", label="unitraj.k_means", shape="box", style="solid"];
"unitraj.lightning" [color="black", label="unitraj.lightning", shape="box", style="solid"];
"unitraj.lightning.lit_datamodule" [color="black", label="unitraj.lightning.lit_datamodule", shape="box", style="solid"];
"unitraj.lightning.lit_module" [color="black", label="unitraj.lightning.lit_module", shape="box", style="solid"];
"unitraj.lightning.lit_trainer_factory" [color="black", label="unitraj.lightning.lit_trainer_factory", shape="box", style="solid"];
"unitraj.models" [color="black", label="unitraj.models", shape="box", style="solid"];
"unitraj.models.autobot" [color="black", label="unitraj.models.autobot", shape="box", style="solid"];
"unitraj.models.autobot.autobot" [color="black", label="unitraj.models.autobot.autobot", shape="box", style="solid"];
"unitraj.models.base_model" [color="black", label="unitraj.models.base_model", shape="box", style="solid"];
"unitraj.models.base_model.av2_eval" [color="black", label="unitraj.models.base_model.av2_eval", shape="box", style="solid"];
"unitraj.models.base_model.base_model" [color="black", label="unitraj.models.base_model.base_model", shape="box", style="solid"];
"unitraj.models.base_model.model_utils" [color="black", label="unitraj.models.base_model.model_utils", shape="box", style="solid"];
"unitraj.models.base_model.waymo_eval" [color="black", label="unitraj.models.base_model.waymo_eval", shape="box", style="solid"];
"unitraj.models.mtr" [color="black", label="unitraj.models.mtr", shape="box", style="solid"];
"unitraj.models.mtr.MTR" [color="black", label="unitraj.models.mtr.MTR", shape="box", style="solid"];
"unitraj.models.mtr.MTR_utils" [color="black", label="unitraj.models.mtr.MTR_utils", shape="box", style="solid"];
"unitraj.models.mtr.loss_utils" [color="black", label="unitraj.models.mtr.loss_utils", shape="box", style="solid"];
"unitraj.models.mtr.motion_utils" [color="black", label="unitraj.models.mtr.motion_utils", shape="box", style="solid"];
"unitraj.models.mtr.ops" [color="black", label="unitraj.models.mtr.ops", shape="box", style="solid"];
"unitraj.models.mtr.ops.attention" [color="black", label="unitraj.models.mtr.ops.attention", shape="box", style="solid"];
"unitraj.models.mtr.ops.attention.attention_utils" [color="black", label="unitraj.models.mtr.ops.attention.attention_utils", shape="box", style="solid"];
"unitraj.models.mtr.ops.attention.attention_utils_v2" [color="black", label="unitraj.models.mtr.ops.attention.attention_utils_v2", shape="box", style="solid"];
"unitraj.models.mtr.ops.knn" [color="black", label="unitraj.models.mtr.ops.knn", shape="box", style="solid"];
"unitraj.models.mtr.ops.knn.knn_utils" [color="black", label="unitraj.models.mtr.ops.knn.knn_utils", shape="box", style="solid"];
"unitraj.models.mtr.transformer" [color="black", label="unitraj.models.mtr.transformer", shape="box", style="solid"];
"unitraj.models.mtr.transformer.multi_head_attention" [color="black", label="unitraj.models.mtr.transformer.multi_head_attention", shape="box", style="solid"];
"unitraj.models.mtr.transformer.multi_head_attention_local" [color="black", label="unitraj.models.mtr.transformer.multi_head_attention_local", shape="box", style="solid"];
"unitraj.models.mtr.transformer.position_encoding_utils" [color="black", label="unitraj.models.mtr.transformer.position_encoding_utils", shape="box", style="solid"];
"unitraj.models.mtr.transformer.transformer_decoder_layer" [color="black", label="unitraj.models.mtr.transformer.transformer_decoder_layer", shape="box", style="solid"];
"unitraj.models.mtr.transformer.transformer_encoder_layer" [color="black", label="unitraj.models.mtr.transformer.transformer_encoder_layer", shape="box", style="solid"];
"unitraj.models.wayformer" [color="black", label="unitraj.models.wayformer", shape="box", style="solid"];
"unitraj.models.wayformer.wayformer" [color="black", label="unitraj.models.wayformer.wayformer", shape="box", style="solid"];
"unitraj.models.wayformer.wayformer_utils" [color="black", label="unitraj.models.wayformer.wayformer_utils", shape="box", style="solid"];
"unitraj.utils" [color="black", label="unitraj.utils", shape="box", style="solid"];
"unitraj.utils.base_config" [color="black", label="unitraj.utils.base_config", shape="box", style="solid"];
"unitraj.utils.config" [color="black", label="unitraj.utils.config", shape="box", style="solid"];
"unitraj.utils.console" [color="black", label="unitraj.utils.console", shape="box", style="solid"];
"unitraj.utils.tsne" [color="black", label="unitraj.utils.tsne", shape="box", style="solid"];
"unitraj.utils.utils" [color="black", label="unitraj.utils.utils", shape="box", style="solid"];
"unitraj.utils.visualization" [color="black", label="unitraj.utils.visualization", shape="box", style="solid"];
"unitraj.viz" [color="black", label="unitraj.viz", shape="box", style="solid"];
"unitraj" -> "unitraj.configs.experiment_config" [arrowhead="open", arrowtail="none"];
"unitraj" -> "unitraj.configs.path_config" [arrowhead="open", arrowtail="none"];
"unitraj" -> "unitraj.configs.wandb_config" [arrowhead="open", arrowtail="none"];
"unitraj" -> "unitraj.datasets.base_dataset" [arrowhead="open", arrowtail="none"];
"unitraj" -> "unitraj.datasets.dataparser" [arrowhead="open", arrowtail="none"];
"unitraj" -> "unitraj.lightning.lit_datamodule" [arrowhead="open", arrowtail="none"];
"unitraj" -> "unitraj.lightning.lit_trainer_factory" [arrowhead="open", arrowtail="none"];
"unitraj" -> "unitraj.models.autobot.autobot" [arrowhead="open", arrowtail="none"];
"unitraj.configs.experiment_config" -> "unitraj.configs.path_config" [arrowhead="open", arrowtail="none"];
"unitraj.configs.wandb_config" -> "unitraj.configs.path_config" [arrowhead="open", arrowtail="none"];
"unitraj.data_analysis" -> "unitraj.datasets" [arrowhead="open", arrowtail="none"];
"unitraj.data_analysis" -> "unitraj.datasets.common_utils" [arrowhead="open", arrowtail="none"];
"unitraj.datasets.MTR_dataset" -> "unitraj.datasets.base_dataset" [arrowhead="open", arrowtail="none"];
"unitraj.datasets.autobot_dataset" -> "unitraj.datasets.base_dataset" [arrowhead="open", arrowtail="none"];
"unitraj.datasets.base_dataparser" -> "unitraj.datasets.common_utils" [arrowhead="open", arrowtail="none"];
"unitraj.datasets.base_dataparser" -> "unitraj.datasets.dataparser" [arrowhead="open", arrowtail="none"];
"unitraj.datasets.base_dataparser" -> "unitraj.datasets.types" [arrowhead="open", arrowtail="none"];
"unitraj.datasets.base_dataset" -> "unitraj.datasets.dataparser" [arrowhead="open", arrowtail="none"];
"unitraj.datasets.base_dataset" -> "unitraj.datasets.types" [arrowhead="open", arrowtail="none"];
"unitraj.datasets.common_utils" -> "unitraj.datasets.types" [arrowhead="open", arrowtail="none"];
"unitraj.datasets.dataparser" -> "unitraj.datasets.base_dataparser" [arrowhead="open", arrowtail="none"];
"unitraj.datasets.dataparser" -> "unitraj.datasets.types" [arrowhead="open", arrowtail="none"];
"unitraj.datasets.wayformer_dataset" -> "unitraj.datasets.base_dataset" [arrowhead="open", arrowtail="none"];
"unitraj.evaluation" -> "unitraj.datasets" [arrowhead="open", arrowtail="none"];
"unitraj.evaluation" -> "unitraj.models" [arrowhead="open", arrowtail="none"];
"unitraj.evaluation" -> "unitraj.utils.utils" [arrowhead="open", arrowtail="none"];
"unitraj.k_means" -> "unitraj.datasets" [arrowhead="open", arrowtail="none"];
"unitraj.k_means" -> "unitraj.utils.utils" [arrowhead="open", arrowtail="none"];
"unitraj.models" -> "unitraj.models.autobot.autobot" [arrowhead="open", arrowtail="none"];
"unitraj.models" -> "unitraj.models.mtr.MTR" [arrowhead="open", arrowtail="none"];
"unitraj.models" -> "unitraj.models.wayformer.wayformer" [arrowhead="open", arrowtail="none"];
"unitraj.models.autobot.autobot" -> "unitraj.models.base_model.base_model" [arrowhead="open", arrowtail="none"];
"unitraj.models.base_model.base_model" -> "unitraj.models.base_model.av2_eval" [arrowhead="open", arrowtail="none"];
"unitraj.models.base_model.base_model" -> "unitraj.models.base_model.waymo_eval" [arrowhead="open", arrowtail="none"];
"unitraj.models.mtr.MTR" -> "unitraj.models.mtr.MTR_utils" [arrowhead="open", arrowtail="none"];
"unitraj.models.mtr.MTR" -> "unitraj.models.mtr.ops.knn" [arrowhead="open", arrowtail="none"];
"unitraj.models.mtr.MTR" -> "unitraj.models.mtr.transformer" [arrowhead="open", arrowtail="none"];
"unitraj.models.mtr.ops.attention.attention_utils" -> "unitraj.models.mtr.ops.attention" [arrowhead="open", arrowtail="none"];
"unitraj.models.mtr.ops.attention.attention_utils_v2" -> "unitraj.models.mtr.ops.attention" [arrowhead="open", arrowtail="none"];
"unitraj.models.mtr.ops.knn.knn_utils" -> "unitraj.models.mtr.ops.knn" [arrowhead="open", arrowtail="none"];
"unitraj.models.mtr.transformer.multi_head_attention_local" -> "unitraj.models.mtr.ops" [arrowhead="open", arrowtail="none"];
"unitraj.models.mtr.transformer.transformer_decoder_layer" -> "unitraj.models.mtr.transformer.multi_head_attention" [arrowhead="open", arrowtail="none"];
"unitraj.models.mtr.transformer.transformer_decoder_layer" -> "unitraj.models.mtr.transformer.multi_head_attention_local" [arrowhead="open", arrowtail="none"];
"unitraj.models.mtr.transformer.transformer_decoder_layer" -> "unitraj.models.mtr.transformer.transformer_encoder_layer" [arrowhead="open", arrowtail="none"];
"unitraj.models.mtr.transformer.transformer_encoder_layer" -> "unitraj.models.mtr.transformer.multi_head_attention" [arrowhead="open", arrowtail="none"];
"unitraj.models.mtr.transformer.transformer_encoder_layer" -> "unitraj.models.mtr.transformer.multi_head_attention_local" [arrowhead="open", arrowtail="none"];
"unitraj.models.wayformer.wayformer" -> "unitraj.models.base_model.base_model" [arrowhead="open", arrowtail="none"];
"unitraj.models.wayformer.wayformer" -> "unitraj.models.wayformer.wayformer_utils" [arrowhead="open", arrowtail="none"];
"unitraj.utils.base_config" -> "unitraj.utils.console" [arrowhead="open", arrowtail="none"];
"unitraj.viz" -> "unitraj.datasets" [arrowhead="open", arrowtail="none"];
"unitraj.viz" -> "unitraj.utils.visualization" [arrowhead="open", arrowtail="none"];
}
